
<!DOCTYPE HTML>
<html lang="ru" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>KISS · Developer Interview Questions</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Andrew Cohen">
        
        
    
    <link rel="stylesheet" href="../../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-hints/plugin-hints.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="TMTOWTDI.html" />
    
    
    <link rel="prev" href="GRASP.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Введите условия поиска" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Главная
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Java</li>
        
        
    

    
        
        <li class="header">Common</li>
        
        
    
        <li class="chapter " data-level="3.1" >
            
                <span>
            
                    
                    Data Store & Database
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="3.1.1" data-path="../common/database/SQL.html">
            
                <a href="../common/database/SQL.html">
            
                    
                    SQL
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.1.2" data-path="../common/data/JSON.html">
            
                <a href="../common/data/JSON.html">
            
                    
                    JSON
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Utilites</li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="../common/utilites/vcs/Git.html">
            
                <a href="../common/utilites/vcs/Git.html">
            
                    
                    Git
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="../common/utilites/build_tools/Maven.html">
            
                <a href="../common/utilites/build_tools/Maven.html">
            
                    
                    Maven
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Testing</li>
        
        
    
        <li class="chapter " data-level="5.1" >
            
                <span>
            
                    
                    Unit Testing
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="5.1.1" data-path="../testing/unit/JUnit.html">
            
                <a href="../testing/unit/JUnit.html">
            
                    
                    JUnit
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">Patterns</li>
        
        
    

    
        
        <li class="header">Concepts</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="OOP.html">
            
                <a href="OOP.html">
            
                    
                    OOP
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="DRY.html">
            
                <a href="DRY.html">
            
                    
                    DRY
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.3" data-path="GRASP.html">
            
                <a href="GRASP.html">
            
                    
                    GRASP
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="7.4" data-path="KISS.html">
            
                <a href="KISS.html">
            
                    
                    KISS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.5" data-path="TMTOWTDI.html">
            
                <a href="TMTOWTDI.html">
            
                    
                    TMTOWTDI
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.6" data-path="YAGNI.html">
            
                <a href="YAGNI.html">
            
                    
                    YAGNI
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Опубликовано с помощью GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >KISS</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="kiss">KISS</h1>
<p><code>KISS</code> &#x430;&#x43A;&#x440;&#x43E;&#x43D;&#x438;&#x43C; &#x434;&#x43B;&#x44F; &#xAB;Keep it simple&#xBB; &#x2014; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;, &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x44B;&#x439; &#x432; &#x412;&#x41C;&#x421; &#x421;&#x428;&#x410; &#x432; 1960.</p>
<p>&#x41F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; KISS &#x443;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x430;&#x435;&#x442;, &#x447;&#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x438;&#x43D;&#x441;&#x442;&#x432;&#x43E; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43C; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x44E;&#x442; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E;, &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D;&#x438; &#x43E;&#x441;&#x442;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x44B;&#x43C;&#x438;, &#x430; &#x43D;&#x435; &#x443;&#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x44F;&#x44E;&#x442;&#x441;&#x44F;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x432; &#x43E;&#x431;&#x43B;&#x430;&#x441;&#x442;&#x438; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x442;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x431;&#x44B;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x43E;&#x439; &#x438;&#x437; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x44B;&#x445; &#x446;&#x435;&#x43B;&#x435;&#x439;, &#x438; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x438;&#x437;&#x431;&#x435;&#x433;&#x430;&#x442;&#x44C; &#x43D;&#x435;&#x43D;&#x443;&#x436;&#x43D;&#x43E;&#x439; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x438;. &#x412;&#x430;&#x440;&#x438;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430; &#x444;&#x440;&#x430;&#x437;&#x443; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x430;&#x44E;&#x442; &#xAB;&#x430;&#x43D;&#x433;&#x43B;. Keep it Simple, Silly&#xBB;, &#xAB;Keep it short and simple&#xBB;, &#xAB;keep it small and simple&#xBB;, &#xAB;Keep it simple, stupid&#xBB;.</p>
<p>&#x42D;&#x442;&#x43E;&#x442; &#x43F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43E; &#x438;&#x43B;&#x43B;&#x44E;&#x441;&#x442;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x435;&#x439;, &#x43A;&#x43E;&#x433;&#x434;&#x430; &#x414;&#x436;&#x43E;&#x43D;&#x441;&#x43E;&#x43D; &#x432;&#x440;&#x443;&#x447;&#x438;&#x43B; &#x43A;&#x43E;&#x43C;&#x430;&#x43D;&#x434;&#x435; &#x438;&#x43D;&#x436;&#x435;&#x43D;&#x435;&#x440;&#x43E;&#x432;-&#x43A;&#x43E;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43A;&#x442;&#x43E;&#x440;&#x43E;&#x432; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x43E;&#x432;, &#x431;&#x440;&#x43E;&#x441;&#x438;&#x432; &#x438;&#x43C; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x441; &#x442;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x440;&#x435;&#x430;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x44B;&#x439; &#x441;&#x430;&#x43C;&#x43E;&#x43B;&#x451;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43B;&#x438;, &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x431;&#x44B;&#x442;&#x44C; &#x440;&#x435;&#x43C;&#x43E;&#x43D;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x44B;&#x43C; &#x434;&#x43B;&#x44F; &#x441;&#x440;&#x435;&#x434;&#x43D;&#x435;&#x433;&#x43E; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x43A;&#x430; &#x432; &#x43F;&#x43E;&#x43B;&#x435; &#x432; &#x431;&#x43E;&#x435;&#x432;&#x44B;&#x445; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x44F;&#x445; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441; &#x44D;&#x442;&#x438;&#x43C;&#x438; &#x438;&#x43D;&#x441;&#x442;&#x440;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x43C;&#x438;. &#x422;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;, &#xAB;stupid&#xBB; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x441;&#x44F; &#x43A; &#x43E;&#x442;&#x43D;&#x43E;&#x448;&#x435;&#x43D;&#x438;&#x44E; &#x43C;&#x435;&#x436;&#x434;&#x443; &#x442;&#x435;&#x43C;, &#x447;&#x442;&#x43E; &#x432;&#x441;&#x451; &#x43B;&#x43E;&#x43C;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x438; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x43C;&#x43E;&#x43D;&#x442;&#x430;.</p>
<ul>
<li>&#x420;&#x430;&#x437;&#x431;&#x438;&#x432;&#x430;&#x439;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x43D;&#x430; &#x43F;&#x43E;&#x434;&#x437;&#x430;&#x434;&#x430;&#x447;&#x438; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43D;&#x435; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43F;&#x43E; &#x432;&#x430;&#x448;&#x435;&#x43C;&#x443; &#x43C;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x434;&#x43B;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x431;&#x43E;&#x43B;&#x435;&#x435; 4-12 &#x447;&#x430;&#x441;&#x43E;&#x432; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x43A;&#x43E;&#x434;&#x430;</li>
<li>&#x420;&#x430;&#x437;&#x431;&#x438;&#x432;&#x430;&#x439;&#x442;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x443; &#x43D;&#x430; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x438;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;, &#x43A;&#x430;&#x436;&#x434;&#x430;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x440;&#x435;&#x448;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x43B;&#x438; &#x43F;&#x430;&#x440;&#x43E;&#x439; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x43E;&#x432;</li>
<li>&#x421;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x439;&#x442;&#x435; &#x432;&#x430;&#x448;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x438;&#x43C;&#x438;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x442;&#x44C; &#x43D;&#x435; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x447;&#x435;&#x43C; &#x438;&#x437; 30-40 &#x441;&#x442;&#x440;&#x43E;&#x43A;. &#x41A;&#x430;&#x436;&#x434;&#x44B;&#x439; &#x43C;&#x435;&#x442;&#x43E;&#x434; &#x434;&#x43E;&#x43B;&#x436;&#x435;&#x43D; &#x440;&#x435;&#x448;&#x430;&#x442;&#x44C; &#x43E;&#x434;&#x43D;&#x443; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x443;&#x44E; &#x437;&#x430;&#x434;&#x430;&#x447;&#x443;, &#x430; &#x43D;&#x435; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;&#x432;. &#x415;&#x441;&#x43B;&#x438; &#x432; &#x432;&#x430;&#x448;&#x435;&#x43C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x435; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439;, &#x440;&#x430;&#x437;&#x431;&#x435;&#x439;&#x442;&#x435; &#x435;&#x433;&#x43E; &#x43D;&#x430; &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E;. &#x42D;&#x442;&#x43E; &#x43F;&#x43E;&#x432;&#x44B;&#x441;&#x438;&#x442; &#x447;&#x438;&#x442;&#x430;&#x435;&#x43C;&#x43E;&#x441;&#x442;&#x44C;, &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x438;&#x442; &#x43B;&#x435;&#x433;&#x447;&#x435; &#x43F;&#x43E;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434; &#x438; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x438; &#x432; &#x43D;&#x451;&#x43C;. &#x412;&#x44B; &#x43F;&#x43E;&#x43B;&#x44E;&#x431;&#x438;&#x442;&#x435; &#x443;&#x43B;&#x443;&#x447;&#x448;&#x430;&#x442;&#x44C; &#x43A;&#x43E;&#x434;.</li>
<li>&#x421;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x44F;&#x439;&#x442;&#x435; &#x432;&#x430;&#x448;&#x438; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x44B; &#x43C;&#x430;&#x43B;&#x435;&#x43D;&#x44C;&#x43A;&#x438;&#x43C;&#x438;. &#x417;&#x434;&#x435;&#x441;&#x44C; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x430; &#x436;&#x435; &#x442;&#x435;&#x445;&#x43D;&#x438;&#x43A;&#x430; &#x447;&#x442;&#x43E; &#x438; &#x441; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438;.</li>
<li>&#x41D;&#x435; &#x431;&#x43E;&#x439;&#x442;&#x435;&#x441;&#x44C; &#x438;&#x437;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C;&#x441;&#x44F; &#x43E;&#x442; &#x43A;&#x43E;&#x434;&#x430;. &#x418;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x442;&#x430;&#x440;&#x43E;&#x433;&#x43E; &#x43A;&#x43E;&#x434;&#x430; &#x438; &#x43D;&#x430;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x434;&#x432;&#x430; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x432;&#x430;&#x436;&#x43D;&#x44B;&#x445; &#x43C;&#x43E;&#x43C;&#x435;&#x43D;&#x442;&#x430;. &#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B; &#x441;&#x442;&#x43E;&#x43B;&#x43A;&#x43D;&#x443;&#x43B;&#x438;&#x441;&#x44C; &#x441; &#x43D;&#x43E;&#x432;&#x44B;&#x43C;&#x438; &#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;&#x43C;&#x438;, &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x431;&#x44B;&#x43B;&#x438; &#x43E;&#x43F;&#x43E;&#x432;&#x435;&#x449;&#x435;&#x43D;&#x44B; &#x43E; &#x43D;&#x438;&#x445; &#x440;&#x430;&#x43D;&#x435;&#x435;, &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43F;&#x43E;&#x440;&#x43E;&#x439; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43F;&#x440;&#x438;&#x434;&#x443;&#x43C;&#x430;&#x442;&#x44C; &#x43D;&#x43E;&#x432;&#x43E;&#x435; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x438;&#x437;&#x44F;&#x449;&#x43D;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435; &#x440;&#x435;&#x448;&#x430;&#x44E;&#x449;&#x435;&#x435; &#x438; &#x441;&#x442;&#x430;&#x440;&#x44B;&#x435; &#x438; &#x43D;&#x43E;&#x432;&#x44B;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;.</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="GRASP.html" class="navigation navigation-prev " aria-label="Previous page: GRASP">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="TMTOWTDI.html" class="navigation navigation-next " aria-label="Next page: TMTOWTDI">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"KISS","level":"7.4","depth":1,"next":{"title":"TMTOWTDI","level":"7.5","depth":1,"path":"content/concepts/TMTOWTDI.MD","ref":"content/concepts/TMTOWTDI.MD","articles":[]},"previous":{"title":"GRASP","level":"7.3","depth":1,"path":"content/concepts/GRASP.MD","ref":"content/concepts/GRASP.MD","articles":[]},"dir":"ltr"},"config":{"plugins":["custom-favicon","github","-sharing","hide-element","back-to-top-button","youtube","validate-links","gist","hints","sitemap"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"validate-links":{"defaultScheme":"https","local":"warn","remote":"disabled"},"gist":{},"youtube":{},"github":{"url":"https://github.com/swchck"},"search":{},"hints":{"danger":"fa fa-exclamation-circle","info":"fa fa-info-circle","tip":"fa fa-mortar-board","working":"fa fa-wrench"},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":"favicon.ico","sitemap":{"hostname":"https://swchck.github.io/iddqd/"},"back-to-top-button":{},"custom-favicon":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Andrew Cohen","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Developer Interview Questions","language":"ru","gitbook":"*","description":"Definitive guide to Software developer interview"},"file":{"path":"content/concepts/KISS.MD","mtime":"2020-11-17T23:41:13.051Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-17T23:41:49.806Z"},"basePath":"../..","book":{"language":"ru"}});
        });
    </script>
</div>

        
    <script src="../../../gitbook/gitbook.js"></script>
    <script src="../../../gitbook/theme.js"></script>
    
        
        <script src="../../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/gist-embed/2.4/gist-embed.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-gist/plugin.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

